## Terraform Plan Results - `dev`

<details>
<summary>📋 Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_windows_virtual_machine.main must be replaced
-/+ resource "azurerm_windows_virtual_machine" "main" {
      ~ computer_name                                          = "vm-demo-dev" -> (known after apply)
      ~ disk_controller_type                                   = "SCSI" -> (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/6e009161-8480-4337-ab64-574a4eed8b93/resourceGroups/demo-dev-rg/providers/Microsoft.Compute/virtualMachines/vm-demo-dev" -> (known after apply)
      ~ name                                                   = "vm-demo-dev" -> "vm-demo-dev-pr" # forces replacement
      ~ private_ip_address                                     = "10.0.1.4" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.0.1.4",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Project"     = "terraform-template"
        }
      ~ virtual_machine_id                                     = "f0d32b0f-02d4-4fbc-9674-58c0d59537dc" -> (known after apply)
      ~ vm_agent_platform_updates_enabled                      = true -> false
      - vtpm_enabled                                           = false -> null
        # (17 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ name                      = "vm-demo-dev_OsDisk_1_f8413221ff2042ebad9ff6833bd66615" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

**Status:** success
